# EXAM_02_05. 205

## Задание
| Exam_02_05 | |
| ------ | ------- |
| Уровень: | 1 |
| Темы: | Ввод/вывод данных. |
| Директория для решения: | src/ |
| Файлы решения: | main.c |
| Входные данные: | - |
| Выходные данные: | Стадартный поток вывода (stdout) |

Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. Программа должна выевсти на экран число 205. В конце ответа не должно быть переноса на новую строку.

```c
#include <stdio.h>

int main(void)
{
    int x = 205;
    printf("%05d", &x);

    return 0;
}
```

> **Внимание:** Мы любезно напоминаем вам, что процедура тестирования вашей программы включает анализ стиля кода. Пожалуйста, загляните в папку "materials/". Также обязательно проверяйте вашу программу на утечки памяти.