# EXAM_01_03. Исправление ошибок №3

## Задание
| Exam_01_03 | |
| ------ | ------- |
| Уровень: | 1 |
| Темы: | Базовые типы данных, объявление переменных, оператор присваивания. |
| Директория для решения: | src/ |
| Файлы решения: | main.c |
| Входные данные: | Стадартный поток ввода (stdin) |
| Выходные данные: | Стадартный поток вывода (stdout) |

При написании программы была допущена ошибка. Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую строку.

```c
#include <stdio.h>

int main(void)
{
    int: first = 3, second = 4;

    scanf("%d %d", &first, &second);
    printf("%d", first * second);

    return 0;
}
```

## Примеры

| Входные данные | Результат работы |
| ------ | ------ |
| 2 2 | 4 |
| -4 4 | -16 |

> **Внимание:** Мы любезно напоминаем вам, что процедура тестирования вашей программы включает анализ стиля кода. Пожалуйста, загляните в папку "materials/". Также обязательно проверяйте вашу программу на утечки памяти.