# EXAM_02_01. Некорректная работа программы №1

## Задание
| Exam_02_01 | |
| ------ | ------- |
| Уровень: | 1 |
| Темы: | Ввод/вывод данных. |
| Директория для решения: | src/ |
| Файлы решения: | main.c |
| Входные данные: | Стадартный поток ввода (stdin) |
| Выходные данные: | Стадартный поток вывода (stdout) |

Необходимо исправить синтаксические, стилевые и логические ошибки, не изменяя работу программы. В конце ответа не должно быть переноса на новую строку.

```c
#include <stdio.h>

int main(void)
{
    int x = 0;

    scanf("%d", x);
    printf("%05d", x);

    return 0;
}
```

## Примеры

| Входные данные | Результат работы |
| ------ | ------ |
| 0 | 00000 |
| 1 | 00001 |
| -12 | -0012 |
| 666666 | 666666 |

> **Внимание:** Мы любезно напоминаем вам, что процедура тестирования вашей программы включает анализ стиля кода. Пожалуйста, загляните в папку "materials/". Также обязательно проверяйте вашу программу на утечки памяти.